app/Models/Modelauth.php

    public function ceklogin($iduser)
    {
        $query = $this->table($this->table)->getWhere(['iduser' => $iduser]);
---
SELECT *
FROM `users`
WHERE `iduser` = 'zans098932'